Update diagram README.md
